[
    {
        "id": 0,
        "question": "A wine company sells two products. Its regular wine and a premium aged wine. The company makes x1 bottles of the regular wine per day and x2 bottled of the premium wine per day (x1 and x2 are unknown values greater than or equal to 0). The profit per bottle of regular wine is $20 ad the profit per bottle of the premium wine is $50. Current demand for the wine is at most 80 bottles of the regular wine per day and at most 50 bottles of the premium wine per day. The company only has enough supply to make 120 bottles of either type each day. How many bottles of each wine, regular and premium, should the company make to maximize profit?",
        "results": {
            "Number of bottles of regular wine to make per day": "",
            "Number of bottles of premium wine to make per day": "",
            "Maximum profit per day": ""
        }
    },
    {
        "id": 1,
        "question": "A woman has $5000 to invest in her sisters' companies. She can invest in her younger sister's company and her elder sister's company. Each dollar invested in her younger sister's company yields a profit of $0.05 while each dollar invested in her elder sister's company yields a profit of $0.08. She wants to invest a minimum of 40% of her investment into her younger sister's company and at least $2000 in her elder sister's company. How much money should she invest in each to maximize her profit?",
        "results": {
            "The amount to invest in the younger sister's company": "",
            "The amount to invest in the elder sister's company": "",
            "The maximum profit from the investment": ""
        }
    },
    {
        "id": 2,
        "question": "A furniture factory makes two products: bedside tables and bookcases. Both products have to go through two processes: crafting and polishing. For each bedside table, the workers spend 2.5 hours crafting and 1.5 hours polishing. For each bookcase, the workers spend 5 hours crafting and 3 hours polishing. On any day, there is a maximum of 30 crafting hours available and 20 polishing hours available. The profit from the sale of each bedside table is $200 and the profit from the sale of each bookcase is $500. The factory can sell everything they make. How should they schedule daily production in order to maximize profit?",
        "results": {
            "The number of bedside tables produced": "",
            "The number of bookcases produced": "",
            "The total profit": ""
        }
    },
    {
        "id": 3,
        "question": "A factory makes soccer balls and basket balls. Soccer balls take 5 minutes on the manufacturing machine and 3 minutes to fill with air. Basket balls take 7 minutes on the manufacturing machine and 4 minutes to fill with air. The factory can run the manufacturing machine for at most 700 minutes and they have 500 minutes available for filling the balls with air. If the profit per soccer ball is $4 and the profit per basket all is $5, how many of each ball should the factory make to maximize profit?",
        "results": {
            "The number of soccer balls": "",
            "The number of basket balls": "",
            "The total profit": ""
        }
    },
    {
        "id": 4,
        "question": "Emma is required to take two medicines AX7 and BY5 every day. She needs to take at least 6 grams of AX7 and 8 grams of BY5 every day. These medicines are available in two pills named Klun and Tao. One pill of Klun contains 1.5 grams of AX7 while one pill of Tao contains 1.3 grams of AX7. On the other hand, one pill of Klun contains 1.8 grams of BY5 and one pill of Tao contains 2 grams of BY5. The cost per pill of Klun is $2.6 and the cost per pill of Tao is $3.2. Formulate an LP such that the medicine requirement can be fulfilled at the lowest cost.",
        "results": {
            "The number of Klun pills": "",
            "The number of Tao pills": "",
            "The total cost is": ""
        }
    },
    {
        "id": 5,
        "question": "A cosmetics company makes low, medium, and high quality face wash. A low quality face wash contains 1 unit of rare ingredients and 4 units of water. A medium quality face wash contains 3 units of rare ingredients and 2 units of water. A high quality face wash contains 4 units of rare ingredients and 1 unit of water. The company has available 100 units of rare ingredients and 200 units of water. If the profit per low quality face wash is $3, the profit per medium quality face wash is $7, and the profit per high quality face wash is $9, how many of each should be made to maximize profits?",
        "results": {
            "The number of low quality face wash": "",
            "The number of medium quality face wash": "",
            "The number of high quality face wash": "",
            "The total profit": ""
        }
    },
    {
        "id": 6,
        "question": "A gardener has 50 acres available for growing lavender and tulips. The gardener must grow at least 5 acres of lavender and at least 8 acres of tulips. Even though lavenders sell better, the gardener can grow at most twice the amount of lavender as tulips. If the profit per acre of lavender is $250 and the profit per acre of tulips is $200, how many acres of each should be grown to maximize profit?",
        "results": {
            "The number of acres of lavender grown": "",
            "The number of acres of tulips grown": "",
            "Total profit": ""
        }
    },
    {
        "id": 7,
        "question": "A factory packages glass jars and plates. Glass jars take 15 minutes of worker time and 3 units of cardboard. Plates take 12 minutes of worker time and 4 units of cardboard. The factory has 620 minutes of worker time available and 120 units of cardboard available. If the profit per glass jar packaged is $2 and the profit per plate packaged is $2.50, how many of each should they package to maximize profit?",
        "results": {
            "The number of glass jars to package": "",
            "The number of plates to package": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 8,
        "question": "A fruit store wants to liquidate its stock of 30 lemons, 40 mangos, and 50 pears. Given past experience, the store knows that they can propose a mango-lovers package with 4 lemons and 8 mangos and that this package will bring a profit of 5 euros. Similarly, they can prepare a regular package with 3 lemons, 5 mangos, and 10 pears, yielding a profit of 6.5 euros. They know they can sell any quantity of these two packages within the availability of its stock. What quantity of each package, mango-lovers packages and regular packages, should the store prepare to maximize net profit?",
        "results": {
            "The number of mango-lovers packages": "",
            "The number of regular packages": "",
            "Net profit": ""
        }
    },
    {
        "id": 9,
        "question": "A bakery only has 1000 units of blueberries to make pies and small tarts. Each pie needs 5 units of blueberries and each tart needs 3 units of blueberries. Since tarts are easier to eat quickly, the bakery must make at least three times as many tarts as pies. However, the bakery must make at least 30 pies. If each pie sold yields a profit of $8 and each tart sold yields a profit of $5, how many of each should the bakery make to maximize profit?",
        "results": {
            "The number of pies to make": "",
            "The number of tarts to make": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 10,
        "question": "Tom Designs manufactures three coats: long, short, and mini. These coats are produced in two different factories: a north one and a south one. Running the north factory for an hour costs $200 and produces 20 long coats, 15 short coats, and 10 mini coats. Running the south factory for an hour costs $400 and yields 30 long coats, 25 short coats, and 30 mini coats. To meet customer demands, a minimum of 75 long coats, 30 short coats, and 40 mini coats must be produced daily. Determine a daily production plan that minimizes the cost of meeting the company’s daily demands.",
        "results": {
            "Number of hours the north factory operates": "",
            "Number of hours the south factory operates": "",
            "Total cost of operation": ""
        }
    },
    {
        "id": 11,
        "question": "Bob Fashion produces two types of lipsticks: cream lipsticks and matte lipsticks. The profit per cream lipstick is $70 and the profit per matte lipstick is $100. It takes 3.5 hours to produce the raw materials for one cream lipstick, 5 hours to mix and 2 hours in packing. It takes 5 hours to produce the raw materials for one matte lipstick, 3 hours to mix and 1.5 hours in packing. Per month, 300 hours are available for preparing the raw materials, 400 hours for mixing and 200 hours for packing the lipsticks.  How many of each type of lipstick should be produced in order to maximize the total monthly profit?",
        "results": {
            "The number of cream lipsticks to be produced": "",
            "The number of matte lipsticks to be produced": "",
            "The total monthly profit": ""
        }
    },
    {
        "id": 12,
        "question": "A food manufacturer wishes to mix pork and chicken to create sausages. The mixture needs to contain at least 10 units of protein and 15 units of fat. Pork costs $40 per kg and chicken costs $50 per kg. Per kilogram, pork contains 2 units of protein and 4 units of fat. Per kilogram, chicken contains 3 units of protein and 2 units of fat. Determine the minimum cost of the mixture.",
        "results": {
            "The amount of pork in kg": "",
            "The amount of chicken in kg": "",
            "The minimum cost of the mixture": ""
        }
    },
    {
        "id": 13,
        "question": "A soup store sell two soups: a crab soup and a lobster soup. The soups are made using water, crab meat, and lobster meat. A serving of crab soup requires 7 units of water and 8 units of crab meat. A serving of lobster soup requires 10 units of water and 5 units of lobster meat. There is 80 units of water available, 65 units of crab meat available, and 55 units of lobster meat available. The profit per serving of crab soup is $3 and the profit per serving of lobster soup is $5. Formulate as a LP to maximize profit.",
        "results": {
            "The number of servings of crab soup": "",
            "The number of servings of lobster soup": "",
            "The total profit": ""
        }
    },
    {
        "id": 14,
        "question": "A landscaper provides 3 landscaping layouts using different amounts of rock, mulch, and grass. He has 1200 units of rock, 700 units of mulch, and 2000 units of grass. A type A layout has 10 units of rock, 7 units of mulch, and 15 units of grass. A type B layout has 5 units of rock, 12 units of mulch, and 10 units of grass. A type C layout has 12 units of rock, 4 units of mulch, and 12 units of grass. The profit is $200 for each type A layout, $175 for each type B layout, and $225 for each type C layout. How many layouts of each type should be used to maximize profit?",
        "results": {
            "The number of type A layouts": "",
            "The number of type B layouts": "",
            "The number of type C layouts": "",
            "Total profit": ""
        }
    },
    {
        "id": 15,
        "question": "A sign company makes signs by hand. They make LED signs and neon signs. The LED signs are made by team A and they can make at most 3 a day. The neon signs are made by team B and they can make at most 4 a day. All signs have to be quality checked by a senior QC inspector and he can check at most 7 signs total a day. If the profit per LED sign is $1500 and the profit per neon sign is $1450, how many of each sign should be made to maximize profit?",
        "results": {
            "The number of LED signs made": "",
            "The number of neon signs made": "",
            "The total profit": ""
        }
    },
    {
        "id": 16,
        "question": "A jewelry company produces and sells bracelets and rings. The bracelets are hand-crafted by a team who can make at most 4 bracelets per day. The rings are made by another team who can make at most 7 rings per day. All rings have to be approved by a master jeweler and he can check at most 30 jewels of either type per day. If the profit per bracelet is $700 and the profit per ring is $300, how many of each should the jewelry company make to maximize profit?",
        "results": {
            "The number of bracelets to make": "",
            "The number of rings to make": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 17,
        "question": "A store sells two types of donuts, regular and jelly-filled.  The store pays a baker $4 and $6 for each unit of a regular and jelly-filled donut respectively. The store makes a profit of $2 per regular donut and a profit of $3 per jelly-filled donut. In a month, the store owner expects to sell at most 1000 donuts and wants to spend at most $5000 in buying donuts from the bakery. How many of each type of donut should be bought in order to maximize the total monthly profit?",
        "results": {
            "The number of regular donuts": "",
            "The number of jelly-filled donuts": "",
            "The total monthly profit": ""
        }
    },
    {
        "id": 18,
        "question": "A cosmetics company makes high-end skincare products whose main customers are wealthy women, both young girls and middle-aged women. In order to promote their product line, they decided to invest in short commercial spots on two types of programs: social media and television. While each social media commercial is seen by 5 million young girls and 1 million middle-aged women, each television commercial is seen by 3 million young girls and 7 million middle-aged women. A 1-minute social media ad costs $30,000, and a 1-minute television ad costs $50,000. The company would like the commercials to be seen by at least 20 million young girls and 30 million middle-aged women. Use linear programming to determine how the cosmetics company can meet its advertising requirements at minimum cost.",
        "results": {
            "The number of social media commercials": "",
            "The number of television commercials": "",
            "The minimum cost": ""
        }
    },
    {
        "id": 19,
        "question": "Two paints of different quality, cheap and expensive, have quality ratings of 50 and 90, respectively. The cheap paint costs $0.30 per liter while the expensive paint costs $1.50 per liter. In order to paint his fence, John wants to use a mix of paint with a quality of at least 80. This ensures that the paint on the fence will withstand a few storms. What blend of the two paints should he mix in order to minimize his cost? [Hint: Let x be the fraction of each liter that is cheap paint and y be the fraction that is expensive paint.]",
        "results": {
            "The fraction of each liter that is cheap paint": "",
            "The fraction of each liter that is expensive paint": "",
            "The minimized cost": ""
        }
    },
    {
        "id": 20,
        "question": "The Curious electronics business wants to determine the level of production of its two hottest digital keyboards: A400 and P500. Making one A400 keyboard requires 5 hours of labour and yields a $35 profit. On the other hand, one P500 keyboard can be produced in 9 hours and offers a greater profit of $80. Given the demand forecast, the business decides to produce at least three times as many A400 keyboards as P500 ones. In addition, it can spend up to 45 hours a week to manufacture these keyboards. Can you help the business determine the number of each keyboard to be produced each week to obtain the maximum profit?",
        "results": {
            "Number of A400 keyboards to produce each week": "",
            "Number of P500 keyboards to produce each week": "",
            "Maximum profit": ""
        }
    },
    {
        "id": 21,
        "question": "In a cold region, a train service offers heated seats and regular seats. The train has 100 seats available. The trains reserves at least 15 seats to be heated. However, at least 3 times as many people prefer regular seats to heated seats. If the profit per heated seat is $20 and the profit per regular seat is $15, how many of each seat type should be sold to maximize profit?",
        "results": {
            "The number of heated seats sold": "",
            "The number of regular seats sold": "",
            "Total profit": ""
        }
    },
    {
        "id": 22,
        "question": "A farm has to transport their chickens. They can either be transported by train or by truck. Each train trip can take 500 chicken while each truck trip can take 300 chicken. The cost per train trip is $100 and the cost per truck trip is $80. The farm has a budget of $2000 and the number of train trips cannot exceed the number of truck trips. How many of each trip should be taken to maximize the number of chickens that can be transported?",
        "results": {
            "The number of train trips": "",
            "The number of truck trips": "",
            "The number of chickens transported": ""
        }
    },
    {
        "id": 23,
        "question": "A gardener has a field of 100 square feet in which he plants sunflowers and roses. The seed for sunflowers costs $67 per square foot. The seed for roses costs $52 per square foot. The gardener has available a budget of $6500 to spend on seeds. The profit per square foot of sunflowers is $450 and the profit per square foot of roses is $100. Find the optimal solution for the gardener in order to maximize profit.",
        "results": {
            "The number of square feet planted with sunflowers": "",
            "The number of square feet planted with roses": "",
            "The total profit": ""
        }
    },
    {
        "id": 24,
        "question": "Amanda has 4000 acres of land to grow apple and peach trees. Apple trees cost $50 for their saplings, and they take 3 hours to maintain per acre. Peach trees cost $80 for their saplings and take 5 hours to maintain per acre. Amanda has a budget of $30000 for saplings and has 600 available hours for maintenance. If the profit per acre of apples is $15 and the profit per acre of peaches is $25, how many acres of each should be grown to maximize profit?",
        "results": {
            "The number of acres for apple trees": "",
            "The number of acres for peach trees": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 25,
        "question": "There is only 3000 grams of black tea available to make earl grey and English breakfast teabags. Each earl grey teabag requires 25 grams of black tea while each English breakfast teabag requires 20 grams of black tea. Due to demand, at least 4 times the amount of earl grey teabags are needed than English breakfast. However, at least 20 English breakfast teabags need to be made. If the profit per earl grey teabag is $0.30 and the profit per English breakfast teabag is $0.25, how many of each should be made to maximize profit?",
        "results": {
            "The number of earl grey teabags": "",
            "The number of English breakfast teabags": "",
            "The total profit": ""
        }
    },
    {
        "id": 26,
        "question": "A milk tea shop has 50000 ml of milk to make two milk teas: black milk tea and green milk tea. A bottle of black milk tea contains 300 ml of milk while a bottle of green milk tea has 200 ml of milk. The shop knows that they need to make at least three times the number of bottles of black milk tea than green milk tea. They also know that they need to make at least 10 bottles of green milk tea. Each bottle of black milk tea is sold for a profit of $2.5 and each bottle of green milk tea is sold for a profit of $7. How many of each type of milk tea needs to be made in order to maximize profit?",
        "results": {
            "The number of bottles of black milk tea": "",
            "The number of bottles of green milk tea": "",
            "Total profit": ""
        }
    },
    {
        "id": 27,
        "question": "A battery store sells AA and D batteries. The store has a budget of $1000 and each AA battery costs $1 and each D battery costs $3. The monthly demand for both batteries will not exceed 1000. If the profit per AA battery is $0.50 and the profit per D battery is $1, how many of each should the store stock in order to maximize profit?",
        "results": {
            "The number of AA batteries to stock": "",
            "The number of D batteries to stock": "",
            "Total profit": ""
        }
    },
    {
        "id": 28,
        "question": "A vendor sells coffee and hot chocolate during ice hockey games. To stay in business, he must sell at least 40 coffees and 20 hot chocolates, but can not make more than 60 coffees or 35 hot chocolates. The vendor also can't make more than 75 items total. The profit on a coffee is $0.22, and the profit on a hot chocolate is $0.14. How many of each item should he sell to make the maximum profit?",
        "results": {
            "The number of coffees sold": "",
            "The number of hot chocolates sold": "",
            "The total profit": ""
        }
    },
    {
        "id": 29,
        "question": "William is a potato farmer and he has to send his product to the city. He can transport his potato packages by regular truck which can take 70 packages per trip or by refrigerated truck which can take 100 packages per trip. The cost per regular truck trip is $50 and the cost per refrigerated truck trip is $70. He wants to spend at most $5000 and the number of refrigerated truck trips must not exceed the number of regular truck trips. Formulate an LP to maximize the number of potato packages that can be transported.",
        "results": {
            "The number of regular truck trips": "",
            "The number of refrigerated truck trips": "",
            "The number of potato packages transported": ""
        }
    },
    {
        "id": 30,
        "question": "A food truck makes apple and orange smoothies. It takes 6 minutes on the cutting machine and 3 minutes on the blending machine to make an apple smoothie. It takes 5 minutes on the cutting machine and 2 minutes on the blending machine to make an orange smoothie. The profit per apple smoothie is $3.5 and the profit per orange smoothie is $4.5. If both the cutting machine and blending machine are available for at most 500 minutes per day, how many of each smoothie should be made to maximize profit?",
        "results": {
            "The number of apple smoothies": "",
            "The number of orange smoothies": "",
            "Total profit": ""
        }
    },
    {
        "id": 31,
        "question": "A car company makes two types of cars, a race car and a regular car. Two different teams produce each of these cars. The race car team can make at most 3 race cars per day while the regular car team can make at most 5 regular cars per day. Both cars need to go through a safety check, and in a day at most 6 cars of either type can be safety checked. If the profit per race car is $20000 and the profit per regular car is $10000, how many of each should the company make to maximize their profit?",
        "results": {
            "The number of race cars produced per day": "",
            "The number of regular cars produced per day": "",
            "The total profit per day": ""
        }
    },
    {
        "id": 32,
        "question": "A pet store feeds their dogs by making a mixture from two bags. Bag A contains 3 units of protein and 4 units of calcium per bag. Bag B contains 4 units of protein and 2 units of calcium per bag. The mixture must contain at least 30 units of protein and 35 units of calcium. Bag A costs $3.50 per bag and Bag B costs $2.50 per bag. Formulate an LP to minimize the cost for the mixture.",
        "results": {
            "The number of bags from Bag A": "",
            "The number of bags from Bag B": "",
            "The cost of the mixture": ""
        }
    },
    {
        "id": 33,
        "question": "A flight has 150 tickets. A profit of $150 is made on each first-class ticket and a profit of $350 is made on each economy-class ticket. The flight reserves at least 20 tickets to be first-class but because the journey is short, at least 3 times as many people prefer to save money and travel by economy-class than first-class. How many of each ticket type should be sold to passengers to maximize profit?",
        "results": {
            "The number of first-class tickets": "",
            "The number of economy-class tickets": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 34,
        "question": "A food truck sells tacos and burritos. To stay in business, they must sell at least 50 tacos and at least 30 burritos. However, they only have enough supplies to make at most 80 tacos and at most 50 burritos. Given their tight schedule, they can also cook at most 100 items total. The profit per taco is $3 and the profit per burrito is $6. How many of each item should they sell to maximize profit?",
        "results": {
            "The number of tacos sold": "",
            "The number of burritos sold": "",
            "Total profit": ""
        }
    },
    {
        "id": 35,
        "question": "An electronics factory manufactures two calculators: solar calculators and finance calculators, using silicon, plastic, and steel. To make a solar calculator, 5 grams of silicon, 4 grams of plastic, and 2 grams of steel are needed. The profit per solar calculator is $12. To make a finance calculator, 3 grams of silicon, 5 grams of plastic, and 3 grams of steel are needed. The profit per finance calculator is $9. Even though the company can sell as many calculators as it produces, there is only 150 grams of silicon, 150 grams of plastic, and 70 grams of steel available. Formulate an LP to maximize profit.",
        "results": {
            "The number of solar calculators produced": "",
            "The number of finance calculators produced": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 36,
        "question": "A framing company frames printed art and paintings. Each printed art takes 10 minutes for printing and 5 minutes for framing. Each painting takes 0 minutes for printing and 15 minutes for framing. The company has available 150 minutes for printing and 400 minutes for framing. If the profit per printed art sold is $5 and the profit per painting sold is $8, how many of each should they produce to maximize profits?",
        "results": {
            "The number of printed arts": "",
            "The number of paintings": "",
            "Total profit": ""
        }
    },
    {
        "id": 37,
        "question": "A furniture company sells two types of tables – a dinning table and a coffee table. They cost $250 and $150 to make respectively. The company estimates that the total monthly demand of these two types of tables combined will be at most 200 units. The monthly manufacturing budget on tables is $20000. Determine the number of units of each type of tables the company should make to get maximum profit if the profit on each dinning table and coffee table are $200 and $100 respectively.",
        "results": {
            "The number of dining tables": "",
            "The number of coffee tables": "",
            "The total profit": ""
        }
    },
    {
        "id": 38,
        "question": "A tropical farmer has 100 acres of land to grow guavas and mangos. He prefers to grow more mangos than guavas, but because they require so much more work, he can grow at most 2 times the amount of mangos as guavas. In addition he must grow at least 20 acres of guavas and at least 40 acres of mangos. If the profit per acre of guavas is $300 and the profit per acres of mangos is $500, how many acre of each should he grow to maximize profit?",
        "results": {
            "The number of acres of guavas to grow": "",
            "The number of acres of mangos to grow": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 39,
        "question": "CE Chemicals produces two types of products, adhesives and plasticizers. To produce each type of product, we need to use both an automatic device and a human-operated device. On a given day, each processing device is available for at most 450 minutes. To extract a package of adhesives, it takes 6 minutes of processing on the automatic device and 5 minutes on human-operated device. To extract a package of plasticizers, the automatic device needs to be run for 8 minutes and the human-operated device for 4 minutes. The manufacturer can sell a package of adhesives for a revenue of $8.5 and plasticizers for a revenue of $11.5. Assuming that the company can sell all the products it produces, how many packages of each product should be produced daily in order to maximize the revenue?",
        "results": {
            "The number of packages of adhesives produced daily": "",
            "The number of packages of plasticizers produced daily": "",
            "The maximum daily revenue": ""
        }
    },
    {
        "id": 40,
        "question": "Eric is a world-famous wood artist. He manufactures two types of decors made of oak. The first product, a display shelf, requires 25 minutes each for carving and 20 minutes each for polishing. The second decor is a plant stand and it requires 20 minutes each for carving and 10 minutes each for polishing. There are 350 minutes available for carving and 600 for polishing. The profit is $55 each for the display shelf and $45 for each plant stand. How many decors of each type should the artist create in order to maximize his profit?",
        "results": {
            "The number of display shelves to manufacture": "",
            "The number of plant stands to manufacture": "",
            "Total profit": ""
        }
    },
    {
        "id": 41,
        "question": "A summer painting company employs students earning $200 a week and full-time employees earning $500 a week. The company needs at least 100 painters of whom at 30 must be full-time employees. In addition, to make sure there is enough experience, the number of full-time employees should be at least half the number of students. Formulate a LP to minimize the wage bill.",
        "results": {
            "The number of student painters": "",
            "The number of full-time painters": "",
            "The total wage bill": ""
        }
    },
    {
        "id": 42,
        "question": "A tasty burrito is to be made from units of beans and onions and is to contain a minimum of 110 units of spice and 80 units of flavor. Beans cost $6 per unit and onion cost $8 per unit. One unit of beans contains 10 units of spice and 3 units of flavor. One unit of onions contains 2 units of spice and 6 units of flavor. Formulate this as an LP and find the minimum cost burrito that can be made.",
        "results": {
            "The number of units of beans": "",
            "The number of units of onions": "",
            "The minimum cost": ""
        }
    },
    {
        "id": 43,
        "question": "Lisa can invest in NFTs and crypto-currency up to $5000. Each dollar invested in NFTs yields $0.30 profit, and each dollar invested in a crypto-currency yields $0.40 profit. A minimum of 25% of all money invested must be in NFTs, and at least $2300 must be in crypto-currency. How can Lisa maximize her profit?",
        "results": {
            "Dollars invested in NFTs": "",
            "Dollars invested in crypto-currency": "",
            "Total profit": ""
        }
    },
    {
        "id": 44,
        "question": "A student group makes chocolate chip and oatmeal cookies. To make a batch of chocolate chip cookies, it take 10 minutes to gather the ingredients, 20 minutes to mix them, and 50 minutes for baking. To make a batch of oatmeal cookies, it takes 8 minutes to gather the ingredients, 15 minutes to mix them, and 30 minutes for baking.  Per week, the group has 1000 minutes to gather ingredients, 1200 minutes for mixing, and 3000 minutes for baking. If the profit per batch of chocolate chip cookies is $12 and the profit per batch of oatmeal cookies is $15, how many batches of each should be made to maximize profit?",
        "results": {
            "The number of batches of chocolate chip cookies": "",
            "The number of batches of oatmeal cookies": "",
            "Total profit": ""
        }
    },
    {
        "id": 45,
        "question": "A meat factory makes burgers and hot-dogs. Each burger requires 3 units of meat and 2 unit of binding agent. Each hot-dog requires 2 units of meat and 1 unit of binding agent. The factory has 2000 units of meat and 1800 units of binding agent available. If the revenue per burger made is $0.30 and the revenue per hot-dog made is $0.20, how many of each should be made to maximize revenue?",
        "results": {
            "The number of burgers made": "",
            "The number of hot-dogs made": "",
            "The total revenue": ""
        }
    },
    {
        "id": 46,
        "question": "A tropical farmer has available 200 acres of land to grow pineapples and bananas. He likes bananas, but because they require so much more work, he can grow at most 4 times the amount of bananas as pineapples. In addition he must grow at least 40 acres of pineapples and at least 60 acres of bananas. If the profit per acre of pineapples is $200 and the profit per acres of bananas is $150, how many acre of each should he grow to maximize profit?",
        "results": {
            "The number of acres of pineapples": "",
            "The number of acres of bananas": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 47,
        "question": "A telecommunications company installs internet service and TV service in buildings. Each internet service takes 60 minutes of wiring time and 10 minutes of box installation time. Each TV service takes 50 minutes of wiring time and 20 minutes of box installation time. The company has available 7000 minutes of wiring time and 4000 minutes of box installation time. If the profit per internet service installation is $100 and the profit per TV service installation is $120, how many of each should be installed to maximize profit?",
        "results": {
            "The number of internet services installed": "",
            "The number of TV services installed": "",
            "The total profit": ""
        }
    },
    {
        "id": 48,
        "question": "A glass company makes sliding doors and windows. They have orders for at least 120 sliding doors and at least 110 windows per day. However, due to supply constraints, the company can make at most 210 sliding doors and at most 170 windows per day. In addition, they have a contract to ship at least 250 products of either type per day. If the profit per sliding door is $30 and the profit per window is $25, how many of each should the company make to maximize profit?",
        "results": {
            "The number of sliding doors to make": "",
            "The number of windows to make": "",
            "Total profit per day": ""
        }
    },
    {
        "id": 49,
        "question": "A hot dog store sells two products: its regular hot-dog, and a premium hot-dog with more toppings. The store makes x1 regular hot-dogs a day at a profit of $3 each and x2 premium hot-dogs a day at a profit of $5 each. (x1 and x2 are unknowns and they both must be greater than or equal to 0). Currently, the demand is limited to at most 100 regular hot-dogs per day and at most 250 premium hot-dogs per day. Also, the store can make a maximum of 300 hot-dogs of either type per day. How many of each hot-dog should be made to maximize profit?",
        "results": {
            "The number of regular hot-dogs to make": "",
            "The number of premium hot-dogs to make": "",
            "Maximum profit per day": ""
        }
    },
    {
        "id": 50,
        "question": "A farmer has 200 acres of land to grow oranges and grapefruits. He must grow at least 60 acres of oranges and at least 50 acres of grapefruits. The farmer prefers to grow more grapefruits than oranges but due to a shortage, he can grow at most twice the amount of grapefruits as oranges. If the profit per acre of oranges is $200, and the profit per acre of grapefruits is $220, how many acres of each should be grown to maximize profit?",
        "results": {
            "The number of acres of oranges to grow": "",
            "The number of acres of grapefruits to grow": "",
            "Total profit": ""
        }
    },
    {
        "id": 51,
        "question": "A hockey arena can hold at most 300 people and has both heated and regular seats. A profit of $30 is made on each heated seat and a profit of $20 is made on each regular seat. The arena reserves a minimum of 50 seats to be heated seats. However, since it is not too cold, at least 3 times as many people prefer to sit in regular seats. How many of each type of seat must be sold in order to maximize profit? What is the maximum profit?",
        "results": {
            "The number of heated seats sold": "",
            "The number of regular seats sold": "",
            "The maximum profit": ""
        }
    },
    {
        "id": 52,
        "question": "A pizza palace is going to purchase pizza ovens. There are two models available. Model A can make 10 pizzas per cycle, requires 80 grams of fuel per cycle, and costs $10000. Model B can make 8 pizzas per cycle, requires 70 grams of fuel per cycle, and costs $8000. The pizza palace must make at least 100 pizzas per cycle and use at most 1000 grams of fuel per cycle. How many of each model pizza oven should they purchase to minimize costs?",
        "results": {
            "The number of Model A ovens to purchase": "",
            "The number of Model B ovens to purchase": "",
            "Total cost": ""
        }
    }
]